fedetft/miosix-kernel/miosix/arch/cortexM3_efm32gg/efm32gg332f1024_wandstem/interfaces-impl/transceiver.cpp
    //With the crystal and capacitor selection in the node, this is required
    //to trim the crystal frequency as close as possible to 32MHz
    writeReg(CC2520Register::FREQTUNE,13);
    
    writeReg(CC2520Register::FRMFILT0,0x00); //disable frame filtering
    writeReg(CC2520Register::FRMFILT1,0x00); //disable frame filtering
    writeReg(CC2520Register::SRCMATCH,0x00); //disable source matching

    //
    // Register that need to update from their default value (as in datasheet)
    //
    
    writeReg(CC2520Register::CCACTRL0,0xF8);
    writeReg(CC2520Register::MDMCTRL0,0x85); //controls modem
    writeReg(CC2520Register::MDMCTRL1,0x14); //controls modem
    writeReg(CC2520Register::RXCTRL,0x3f);
    writeReg(CC2520Register::FSCTRL,0x5a);
    writeReg(CC2520Register::FSCAL1,0x2b);
    writeReg(CC2520Register::AGCCTRL1,0x11);
    writeReg(CC2520Register::ADCTEST0,0x10);
    writeReg(CC2520Register::ADCTEST1,0x0E);
    writeReg(CC2520Register::ADCTEST2,0x03);

    state=CC2520State::IDLE;
}

void Transceiver::turnOff()
{
    if(state==CC2520State::DEEPSLEEP) return;
    state=CC2520State::DEEPSLEEP;
    
    transceiver::reset::low();
    pm.disableTransceiverPowerDomain();
}

void Transceiver::idle()
{
    if(state==CC2520State::DEEPSLEEP) return;
    
    //In case of timeout, abort current transmission
    commandStrobe(CC2520Command::SRFOFF);
    //See diagram on page 69 of datasheet
    commandStrobe(CC2520Command::SFLUSHTX);
    //See errata sheet about SRFOFF possibly leaving unwanted byte in RX fifo
    commandStrobe(CC2520Command::SFLUSHRX);
    clearAllExceptions();
    state=CC2520State::IDLE;
}

void Transceiver::configure(const TransceiverConfiguration& config)
{
    if(config.frequency<minFrequency || config.frequency>maxFrequency)
        throw range_error("config.frequency");
    
    this->config=config;

    if(state==CC2520State::DEEPSLEEP) return;
    if(state!=CC2520State::IDLE) idle();
    
    writeReg(CC2520Register::FREQCTRL,config.frequency-minFrequency);
    writeReg(CC2520Register::FRMCTRL0,0x40*config.crc);
    writeReg(CC2520Register::TXPOWER,txPower(config.txPower));
}

void Transceiver::sendNow(const void* pkt, int size)
{
    if(state==CC2520State::DEEPSLEEP)
        throw runtime_error("Transceiver::sendNow while in deep sleep");
    
    //Can't leave RX on, would cause an RX_FRM_ABORTED if a packet being
    //received is interrupted, we should check that it does not interfere with
    //the RX flow diagram. Moreover STXON does not re-enable the receiver on
    //exit, so we would not be in RX anyway
    if(state==CC2520State::RX) idle();
    
    writePacketToTxBuffer(pkt,size);
    commandStrobe(CC2520Command::STXON);
    handlePacketTransmissionEvents(size);
}

bool Transceiver::sendCca(const void* pkt, int size)
{
    if(state==CC2520State::DEEPSLEEP)
        throw runtime_error("Transceiver::sendCca while in deep sleep");
    
    startRxAndWaitForRssi();
    writePacketToTxBuffer(pkt,size);
    commandStrobe(CC2520Command::STXONCCA);
    if((readReg(CC2520Register::FSMSTAT1) & (1<<3))==0)
    {
        //See diagram on page 69 of datasheet
        commandStrobe(CC2520Command::SFLUSHTX);
        return false;
    }
    handlePacketTransmissionEvents(size);
    return true;
}

void Transceiver::sendAt(const void* pkt, int size, long long when)
{
    if(state==CC2520State::DEEPSLEEP)
        throw runtime_error("Transceiver::sendAt while in deep sleep");
    
    //Can't leave RX on, would cause an ambiguity with the SFD exeption
    if(state==CC2520State::RX) idle();
    
    writePacketToTxBuffer(pkt,size);
    //NOTE: when is the time where the first byte of the packet should be sent,
    //while the cc2520 requires the turnaround from STXON to sending
    if(timer.absoluteWaitTrigger(when-turnaround)==true)
    {
        //See diagram on page 69 of datasheet
        commandStrobe(CC2520Command::SFLUSHTX);
        throw runtime_error("Transceiver::sendAt too late to send");
    }
    handlePacketTransmissionEvents(size);
}

RecvResult Transceiver::recv(void *pkt, int size, long long timeout)
{
    if(state==CC2520State::DEEPSLEEP)
        throw runtime_error("Transceiver::recv while in deep sleep");
    
    RecvResult result;
    if(state!=CC2520State::RX)
    {
        commandStrobe(CC2520Command::SRXON);
        state=CC2520State::RX;
    } else {
        //If we are already receiving, we must first check if there is already
        //at least a packet in the fifo, as it can contain multiple full packets
        int inFifo=readReg(CC2520Register::RXFIFOCNT);
        if(inFifo>0)
        {
            //Ok, we have bytes in the fifo, does that mean that there is a
            //full packet? No, we may have an incomplete packet we are receiving
            //just now, so check that there is a full packet
            int lengthByte=readReg(CC2520Register::RXFIRST);
            //Length byte may be wrong, so check it
            if(lengthByte>127 || lengthByte<(config.crc ? 3 : 1))
            {
                idle();
                throw range_error("Transceiver::recv length error");
            }
            //lengthByte+1 is the number of bytes that should be in the fifo
            //for the full packet to be there (+1 because the length byte counts
            //the bytes excluding the length byte itself)
            if(inFifo>=lengthByte+1)
            {
                //Timestamp is wrong and we know it, so we don't set valid
                result.timestamp=timer.getExtEventTimestamp()-preambleSfdTime;
                
                //We may still be in the middle of another packet reception, so
                //this may cause FRM_DONE to occur without a previous SFD,
                //handlePacketReceptionEvents() has to account for that
                clearException(  CC2520Exception::SFD
                            | CC2520Exception::RX_FRM_DONE);
                readPacketFromRxBuffer(pkt,size,result);
                return result;
            }
        }
    }
    
