fedetft/miosix-kernel/miosix/arch/cortexM3_efm32gg/efm32gg332f1024_wandstem/interfaces-impl/transceiver.cpp
bool Transceiver::handlePacketReceptionEvents(long long timeout, int size, RecvResult& result)
{
    //Wait for the first event to occur (SFD), or timeout
    if(timer.absoluteWaitTimeoutOrEvent(timeout)==true)
    {
        result.error=RecvResult::TIMEOUT;
        return true;
    }
    //NOTE: the returned timestamp is the time where the first byte of the
    //packet is received, while the cc2520 allows timestamping at the SFD
    result.timestamp=timer.getExtEventTimestamp()-preambleSfdTime;
    
    unsigned int exc=getExceptions(0b011);
    if(exc & CC2520Exception::RX_OVERFLOW)
    {
        //In case of overflow, abort current reception
        idle();
        throw runtime_error("Transceiver::handlePacketReceptionEvents overflow");
    }
    if(exc & CC2520Exception::SFD)
    {
        //We actually have observed an SFD exception, so the timestamp is valid.
        //Even if a context switch may have caused a delay and multiple packets
        //have queued up, the SFD will be correct for the first packet, and
        //the remaining ones will (correctly) have the timestampValid flag
        //set to to false
        result.timestampValid=true;
        clearException(CC2520Exception::SFD);
    }
    //Both SFD and RX_FRM_DONE exceptions can occur simultaneously if a context
    //switch occurs causing an unexpected delay. An RX_FRM_DONE not preceded by
    //an SFD exception can also happen if multiple packets have queued up and
    //the exception clearing code has cleared the SFD exception while a packet
    //was being received, after the SFD but before the RX_FRM_DONE
    if(exc & CC2520Exception::RX_FRM_DONE)
    {
        //If both exceptions have occurred, then clear also the second one and
        //return without waiting any longer
        clearException(CC2520Exception::RX_FRM_DONE);
        return false;
    }
    
    //Wait for the second event to occur (RX_FRM_DONE)
    #ifndef LEGACY_HW_TIMER_IN_TICKS
    long long tt=slack+timePerByte*size;
    #else //LEGACY_HW_TIMER_IN_TICKS
    long long tt=maxPacketTimeout;
    #endif //LEGACY_HW_TIMER_IN_TICKS
    auto secondTimeout=config.strictTimeout ? min(timeout,timer.getValue()+tt)
                                            : max(timeout,timer.getValue()+tt);
    if(timer.absoluteWaitTimeoutOrEvent(secondTimeout))
    {
        if(timer.getValue()<timeout)
        {
            //We didn't hit the caller set timeout, something is wrong
            idle();
            throw runtime_error("Transceiver::handlePacketReceptionEvents unexpected timeout");
        }
        result.error=RecvResult::TIMEOUT;
        return true;
    }
    exc=getExceptions(0b010);
    if((exc & CC2520Exception::RX_FRM_DONE)==0)
    {
        //Unexpected situation, didn't get the frm done
        idle();
        throw runtime_error("Transceiver::handlePacketReceptionEvents no frm done");
    }
    clearException(CC2520Exception::RX_FRM_DONE);
    return false;
}

void Transceiver::readPacketFromRxBuffer(void* pkt, int size, RecvResult& result)
{
    {
        TransceiverChipSelect cs;
        spi.sendRecv(toByte(CC2520Command::RXBUF));
        int bytesInBuffer=spi.sendRecv();
        if(bytesInBuffer>127 || bytesInBuffer<(config.crc ? 3 : 1))
        {
            idle();
            throw range_error("Transceiver::readPacketFromRxBuffer length error");
        }
        if(config.crc) bytesInBuffer-=2;
        unsigned char *ptr=reinterpret_cast<unsigned char *>(pkt);
        int bytesToRead=min(bytesInBuffer,size);
        result.size=bytesToRead;
        for(int i=0;i<bytesToRead;i++) *ptr++=spi.sendRecv();
        if(bytesInBuffer>size)
        {
            result.error=RecvResult::TOO_LONG;
            //Read the extra bytes from the transceiver and discard them
            for(int i=0;i<bytesInBuffer-size;i++) spi.sendRecv();
        }
        if(config.crc)
        {
            result.rssi=decodeRssi(spi.sendRecv());   
            unsigned char crcCheck=spi.sendRecv();
            if((crcCheck & 0x80)==0) result.error=RecvResult::CRC_FAIL;
        }
    }
    
    //FIFOP is raised at the end of each valid packet, so clear it
    clearException(CC2520Exception::FIFOP);
    
    //Look for unexpected exceptions
    if(complExcChB::value())
    {
        unsigned int exc=getExceptions(0b101);
        if(exc & CC2520Exception::RX_UNDERFLOW)
        {
            idle();
            throw runtime_error("Transceiver::readPacketFromRxBuffer underflow");
        }
        if(exc & CC2520Exception::RX_FRM_ABORTED)
        {
            idle();
            throw runtime_error("Transceiver::readPacketFromRxBuffer frm aborted");
        }
    }
}

CC2520ExceptionBitmask Transceiver::getExceptions(int part)
{
    unsigned int result=0;
    if(part & 0b001)
        result|=static_cast<unsigned int>(readReg(CC2520Register::EXCFLAG0));
    if(part & 0b010)
        result|=static_cast<unsigned int>(readReg(CC2520Register::EXCFLAG1))<<8;
    if(part & 0b100)
        result|=static_cast<unsigned int>(readReg(CC2520Register::EXCFLAG2))<<16;
    return result;
}

void Transceiver::clearException(CC2520ExceptionBitmask exc)
{
    if(exc & 0xff)     writeReg(CC2520Register::EXCFLAG0,~( exc      & 0xff));
    if(exc & 0xff00)   writeReg(CC2520Register::EXCFLAG1,~((exc>>8)  & 0xff));
    if(exc & 0xff0000) writeReg(CC2520Register::EXCFLAG2,~((exc>>16) & 0xff));
}

void Transceiver::clearAllExceptions()
{
    //Exception channel B : SFD | TX_FRM_DONE | RX_FRM_DONE
    //These are the "expected" exceptions
    //Complementary exception channel B : all other exceptions
    //These are the "unexpected" exceptions, something went wrong
    if(transceiver::excChB::value() || complExcChB::value())
    {
        writeReg(CC2520Register::EXCFLAG0,0);
        writeReg(CC2520Register::EXCFLAG1,0);
        writeReg(CC2520Register::EXCFLAG2,0);
    }
}

void Transceiver::waitXosc()
{
    //TODO: implement it using interrupts
    while(internalSpi::miso::value()==0) ;
}

unsigned char Transceiver::txPower(int dBm)
{
    CC2520TxPower result;
    if(dBm>=5)       result=CC2520TxPower::P_5;
    else if(dBm>=3)  result=CC2520TxPower::P_3;
    else if(dBm==2)  result=CC2520TxPower::P_2;
    else if(dBm==1)  result=CC2520TxPower::P_1;
    else if(dBm==0)  result=CC2520TxPower::P_0;
    else if(dBm>=-2) result=CC2520TxPower::P_m2;
    else if(dBm>=-7) result=CC2520TxPower::P_m7;
    else             result=CC2520TxPower::P_m18;
    return toByte(result);
}

short int Transceiver::decodeRssi(unsigned char reg)
{
    int rawRssi=static_cast<int>(reg);
    if(rawRssi & 0x80) rawRssi-=256; //8 bit 2's complement to int
    return rawRssi-76; //See datasheet
}

} //namespace miosix
